app/views/forest_mailer/welcome_email.html.erb

SELECT "items".* FROM "items" INNER JOIN "item_orders" ON "items"."id" = "item_orders"."item_id" WHERE "item_orders"."order_id" = $1  [["order_id", 31]]
---
  <%compteur = 1%>
<%@order.items.each do |item|%>