app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 6], ["item_id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 6], ["item_id", 1], ["created_at", "2019-03-04 15:27:23.937438"], ["updated_at", "2019-03-04 15:27:23.937438"]]
---
    def create()
      @user = current_user
      item = Item.find(params[:id])
      cart_item = @user.cart.cart_items.find_by(item_id: item.id)
      if cart_item
        cart_item.quantity += 1
        cart_item.save
      else
        current_user.cart.items << item