app/controllers/charges_controller.rb

INSERT INTO "item_orders" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 31], ["item_id", 1], ["created_at", "2019-03-04 15:27:57.065413"], ["updated_at", "2019-03-04 15:27:57.065413"]]
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-03-04 15:27:54.162992"], ["updated_at", "2019-03-04 15:27:54.162992"], ["user_id", 6]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 6]]
DELETE FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" IN ($2, $3)  [["cart_id", 6], ["item_id", 1], ["item_id", 4]]
---
  def create
    @order = Order.create!(user_id: current_user.id)
    current_user.cart.items.each do |item|
      @order.items << item
    end

    current_user.cart.items.clear