app/controllers/places_controller.rb

  def index
   if user_signed_in?
    @places = Place.all
---
SELECT "places".* FROM "places"

    def set_place
      @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]