app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 6], ["created_at", "2019-03-04 15:27:15.044303"], ["updated_at", "2019-03-04 15:27:15.044303"]]
---
  def create_cart
    cart = Cart.new
    cart.user = self
    cart.save